//XEXTJCL1 JOB (TOPAZ),'DEMO CI',MSGCLASS=X,
//    MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//    CLASS=A
//*   EXECUTE XEXTCOB IN BATCH
//*
//CLEANEXT EXEC PGM=IEFBR14
//SYSPRINT  DD  SYSOUT=*
//*
//STEP1  EXEC PGM=XEXTCOB,PARM=00003
//STEPLIB  DD  DISP=SHR,DSN=SALESSUP.GIT1.WRK2.LOAD 
//PARAM    DD  DISP=SHR,DSN=MVSXYE.DEMOCI.PARM(CEEOPTS)
//EMPFILE  DD  DISP=SHR,DSN=MVSXYE.DEMOCI.XEXTDATA
//RPTFILE  DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//*