//MVSXYEAA  JOB (''),'JENKINS',NOTIFY=&SYSUID,CLASS=A,                    
//        MSGCLASS=R,REGION=0M                                                  
//* 
//*
//* Jobcard skeleton